sdes117/MSP430X_MSP430FR5969_LaunchPad_IAR_CCS/Blinky_Demo/main_blinky.c
/*
 * main_blinky.c  —  MSP430FR5969 HIA supervisor (bring-up build)
 *
 * Tasks
 * -----
 *  CLK  (1 Hz)   : increments second counter, drives RP regmap (writes + reads)
 *  Rx   (1 Hz)   : receives tick, toggles LEDs, pulses external WDT lines,
 *                  runs LED blink-code for RP state indication
 *  INA  (2 Hz)   : reads INA219 @ 0x41 (3V3_MSP supply current)
 *
 * Register map
 * ------------
 *  MSP writes:  0x20–0x21 (status), 0x22–0x27 (contact ack stub),
 *               0x28 (mode cmd), 0x98–0x9A (voltage/current TLM),
 *               0xA5 (TLM mode), 0xAE–0xAF (TLM status mirrors)
 *  MSP reads:   0x00–0x03 (header magic), 0x10–0x17 (RP state/health),
 *               0x30–0x33 (RP request flags), 0xF0–0xF5 (fault bitmap)
 *  All stored in g_rp_reg_snapshot (FRAM) — inspect via JTAG after a run.
 *
 * Debug — no serial
 * ------------------
 *  1. FRAM snapshot  (g_rp_reg_snapshot) persists across resets.
 *     Inspect in CCS debugger: hdr_ok, rp_state, rp_uptime_s, fault_bitmap.
 *  2. LED blink code (LED0, P1.3) every 8 seconds:
 *       N blinks = rp_state + 1   (1=BOOT, 2=INIT, 3=NOMINAL, 4=SAFE, 5=FAULT)
 *       Rapid 10 Hz blink         = RP not responding (grace/reset active)
 *
 * Rail control
 * ------------
 *  Debugger-accessible globals g_rega_en / g_regb_en / g_efusea_en / g_efuseb_en
 *  control rail enable/shutdown pins. 1=enabled (default), 0=disabled.
 */

#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"

#include "partest.h"
#include "driverlib.h"
#include <msp430.h>
#include <string.h>

#include "supervisor_i2c.h"
#include "rp_regmap.h"
#include "ina219.h"

/* ------------------------------------------------------------------
 * Task priorities
 * ------------------------------------------------------------------ */
#define PRIORITY_CLK    ( tskIDLE_PRIORITY + 3u )
#define PRIORITY_RX     ( tskIDLE_PRIORITY + 2u )
#define PRIORITY_INA    ( tskIDLE_PRIORITY + 1u )

/* ------------------------------------------------------------------
 * WDT pulse config (MSP external WDT chip heartbeats)
 * ------------------------------------------------------------------ */
#define WDT_LOW_CYCLES          ( 8U )
#define WDT_PULSE_PERIOD_S      ( 2U )

/* ------------------------------------------------------------------
 * RP watchdog monitor
 * ------------------------------------------------------------------ */
#define RP_WDT_TIMEOUT_S        ( 6U )
#define RP_WDT_GRACE_S          ( 10U )
#define RESET_RP_PORT           GPIO_PORT_P2
#define RESET_RP_PIN            GPIO_PIN6

/* ------------------------------------------------------------------
 * LED blink code
 * RP state blink: N = rp_state+1 blinks every BLINK_INTERVAL_S seconds.
 * Rapid blink when RP is in grace/reset window.
 * ------------------------------------------------------------------ */
#define BLINK_INTERVAL_S        ( 8U )
#define BLINK_ON_MS             ( 120U )
#define BLINK_OFF_MS            ( 120U )
#define BLINK_GAP_MS            ( 700U )   /* dark pause after sequence */
#define BLINK_RAPID_MS          ( 50U )    /* rapid: RP not responding  */
#define BLINK_RAPID_COUNT       ( 10U )

/* INA219 instance — 3V3_MSP supply line, address 0x41 */
static const ina219_t g_ina_3v3_msp = {
    .addr           = 0x41u,
    .config         = INA219_CFG_3V3_MSP,
    .calib          = INA219_CALIB_3V3_MSP,
    .current_lsb_ua = INA219_LSB_UA_3V3_MSP,
};

/* ------------------------------------------------------------------
 * Rail enable/disable GPIO
 * ------------------------------------------------------------------ */
#define REGA_EN_PORT    GPIO_PORT_P2
#define REGA_EN_PIN     GPIO_PIN4
#define REGB_EN_PORT    GPIO_PORT_P4
#define REGB_EN_PIN     GPIO_PIN4
#define EFUSEA_SHDN_PORT GPIO_PORT_P3
#define EFUSEA_SHDN_PIN  GPIO_PIN2
#define EFUSEB_SHDN_PORT GPIO_PORT_P1
#define EFUSEB_SHDN_PIN  GPIO_PIN5

/* ------------------------------------------------------------------
 * Debugger-accessible rail control globals
 * ------------------------------------------------------------------ */
volatile uint8_t g_rega_en   = 1u;
volatile uint8_t g_regb_en   = 1u;
volatile uint8_t g_efusea_en = 1u;
volatile uint8_t g_efuseb_en = 1u;

/* ------------------------------------------------------------------
 * INA219 results
 * ------------------------------------------------------------------ */
volatile ina219_data_t g_ina_data = { 0, 0, 0, 0 };
volatile uint8_t       g_ina_ok   = 0u;

#pragma PERSISTENT(g_ina_snapshot)
ina219_data_t g_ina_snapshot = { 0, 0, 0, 0 };

#pragma PERSISTENT(g_ina_snapshot_ok)
uint8_t g_ina_snapshot_ok = 0u;

#pragma PERSISTENT(g_ina_diag_init_rc)
int8_t g_ina_diag_init_rc = 0;

#pragma PERSISTENT(g_ina_diag_read_rc)
int8_t g_ina_diag_read_rc = 0;

#pragma PERSISTENT(g_ina_diag_attempts)
uint16_t g_ina_diag_attempts = 0u;

/* ------------------------------------------------------------------
 * RP register snapshot — FRAM persistent, inspect via JTAG after a run.
 * Updated by the CLK task every second from I2C reads.
 * ------------------------------------------------------------------ */
typedef struct {
    uint8_t  hdr_magic[4];         /* bytes from 0x00–0x03 ('H','I','A','1') */
    uint8_t  hdr_version;          /* REG_REGMAP_VERSION (0x04)              */
    uint8_t  hdr_ok;               /* 1 = magic verified on last read        */
    uint8_t  rp_state;             /* REG_RP_STATE (0x10)                    */
    uint32_t rp_uptime_s;          /* REG_RP_UPTIME0–3 (0x11–0x14)           */
    uint16_t rp_hb_counter;        /* REG_RP_HB0–1 (0x15–0x16)              */
    uint8_t  rp_last_error;        /* REG_RP_LAST_ERROR (0x17)               */
    uint8_t  contact_evt_pending;  /* REG_CONTACT_EVT_PENDING (0x1B)         */
    uint8_t  rp_req_flags;         /* REG_RP_REQ_FLAGS (0x30)                */
    uint8_t  rp_req_code;          /* REG_RP_REQ_CODE (0x31)                 */
    uint16_t fault_bitmap;         /* REG_FAULT_BITMAP_L/H (0xF0–0xF1)       */
    uint8_t  fault_seq;            /* REG_FAULT_SEQ (0xF2)                   */
    uint8_t  cnt_i2c_err;          /* REG_CNT_I2C_ERR (0xF5)                 */
} rp_reg_snapshot_t;

#pragma PERSISTENT(g_rp_reg_snapshot)
rp_reg_snapshot_t g_rp_reg_snapshot = { {0,0,0,0}, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };

/* ------------------------------------------------------------------
 * Internal state
 * ------------------------------------------------------------------ */
#pragma NOINIT(g_boot_count)
uint16_t g_boot_count;

#pragma NOINIT(g_current_second)
uint32_t g_current_second;

#pragma PERSISTENT(g_rp_reset_count)
uint16_t g_rp_reset_count = 0u;

/* Shared between CLK and Rx: CLK sets flag, Rx consumes it for blink */
static volatile uint8_t g_blink_pending  = 0u;  /* 1 = run blink sequence  */
static volatile uint8_t g_blink_rp_state = 0u;  /* state to blink          */
static volatile uint8_t g_blink_rapid    = 0u;  /* 1 = rapid (RP down)     */

static QueueHandle_t xTickQueue = NULL;

extern volatile uint16_t g_last_sysrstiv;

/* ------------------------------------------------------------------
 * Forward declarations
 * ------------------------------------------------------------------ */
static void prvClockTask  (void *pvParameters);
static void prvRxTask     (void *pvParameters);
static void prvInaTask    (void *pvParameters);

static inline void prvApplyRailEnables(void);
static inline void prvPulseWdt1(void);
static inline void prvPulseWdt2(void);
static inline void prvLedSet(uint8_t on);
static void        prvRunBlinkSequence(void);
static int8_t      prv_rp_read(uint8_t reg, uint8_t *buf, uint8_t len);

/* ------------------------------------------------------------------
 * Entry point
 * ------------------------------------------------------------------ */
void main_blinky(void)
{
    uint16_t boot_cause = g_last_sysrstiv;

    if (boot_cause <= SYSRSTIV_DOBOR)
    {
        if (boot_cause <= SYSRSTIV_RSTNMI)
            g_current_second = 0u;
    }
    ++g_boot_count;

    prvApplyRailEnables();

    xTickQueue = xQueueCreate(8u, sizeof(uint8_t));
    configASSERT(xTickQueue != NULL);

    xTaskCreate(prvClockTask, "CLK", configMINIMAL_STACK_SIZE, NULL, PRIORITY_CLK, NULL);
    xTaskCreate(prvRxTask,    "Rx",  configMINIMAL_STACK_SIZE, NULL, PRIORITY_RX,  NULL);
    xTaskCreate(prvInaTask,   "INA", configMINIMAL_STACK_SIZE, NULL, PRIORITY_INA, NULL);

    vTaskStartScheduler();

    for (;;);
}

/* ------------------------------------------------------------------
 * CLK task — 1 Hz heartbeat, RP regmap I/O
 * ------------------------------------------------------------------ */
static void prvClockTask(void *pvParameters)
{
    TickType_t xNext         = xTaskGetTickCount();
    uint8_t    tick          = 1u;
    uint8_t    rp_wdt_timer  = 0u;
    uint8_t    rp_wdt_grace  = RP_WDT_GRACE_S;
    uint8_t    blink_counter = 0u;
    uint8_t    last_cmd_seq  = 0u;   /* track CMD_SEQ written to RP */
    (void)pvParameters;

    /* Convenience macro: write one register to RP then yield briefly so
     * CircuitPython can process it before the next transaction. */
    #define RP_WRITE(reg, ptr, len) \
        (void)i2c_write_reg(RP_I2C_ADDR, (reg), (ptr), (len)); \
        vTaskDelay(pdMS_TO_TICKS(10u))

    /* prv_rp_read used in place of the old RP_READ macro so the return
     * value is usable in if() conditions. */

    for (;;)
    {
        vTaskDelayUntil(&xNext, pdMS_TO_TICKS(1000u));
        ++g_current_second;

        /* ---- RP watchdog monitor  (evaluated FIRST — determines rp_i2c_ok)
         * Skipping I2C writes when RP is non-responsive prevents multi-second
         * stalls that would starve the Rx task and trigger TPS3435 co-reset.
         * ---------------------------------------------------------------- */
        uint8_t rp_i2c_ok = 0u;

        if (rp_wdt_grace > 0u)
        {
            --rp_wdt_grace;
            if (rp_wdt_grace == 0u)
            {
                /* Grace just expired — flush stale edge latches so only fresh
                 * pulses count toward the next timeout window. */
                P3IFG &= (uint8_t)~(BIT1 | BIT7);
            }
            /* RP is rebooting — skip I2C this tick */
        }
        else
        {
            uint8_t rp_ifg = P3IFG & (BIT1 | BIT7);
            if ((rp_ifg & BIT1) && (rp_ifg & BIT7))
            {
                P3IFG        &= (uint8_t)~(BIT1 | BIT7);
                rp_wdt_timer  = 0u;
                rp_i2c_ok     = 1u;
            }
            else
            {
                ++rp_wdt_timer;
                if (rp_wdt_timer >= RP_WDT_TIMEOUT_S)
                {
                    rp_wdt_timer = 0u;
                    ++g_rp_reset_count;
                    GPIO_setOutputLowOnPin(RESET_RP_PORT, RESET_RP_PIN);
                    vTaskDelay(pdMS_TO_TICKS(5u));
                    GPIO_setOutputHighOnPin(RESET_RP_PORT, RESET_RP_PIN);
                    supervisor_i2c_recover();
                    rp_wdt_grace = RP_WDT_GRACE_S;
                    /* rp_i2c_ok stays 0 — skip writes this tick */
                }
                else
                {
                    /* Timer counting but not expired — RP likely still alive */
                    rp_i2c_ok = 1u;
                }
            }
        }

        /* ---- Signal Rx task: trigger blink every BLINK_INTERVAL_S seconds */
        if (++blink_counter >= BLINK_INTERVAL_S)
        {
            blink_counter       = 0u;
            g_blink_rp_state    = g_rp_reg_snapshot.rp_state;
            g_blink_rapid       = (rp_wdt_grace > 0u) ? 1u : 0u;
            g_blink_pending     = 1u;
        }

        /* ---- Build MSP status bytes ---------------------------------------- */
        uint8_t wdt_ok  = ((P2OUT & BIT2) && (P3OUT & BIT4)) ? 1u : 0u;
        uint8_t rail_ok = (g_rega_en && g_efusea_en) ? 1u : 0u;
        uint8_t batt_ok = g_ina_ok;

        uint8_t s0 = (uint8_t)(
              (MODE_STARTUP & STATUS0_MODE_MASK)
            | (wdt_ok  ? STATUS0_WDT_OK  : 0u)
            | (batt_ok ? STATUS0_BATT_OK : 0u)
            | (rail_ok ? STATUS0_RAIL_OK : 0u));

        uint8_t s1 = (uint8_t)(g_ina_ok ? 0u : STATUS1_OC_MCU);

        uint8_t mode_byte = MODE_STARTUP;   /* SM not implemented yet */

        /* ---- I2C writes to RP (only when RP is known responsive) ----------- */
        if (rp_i2c_ok)
        {
            /* --- MSP status --- */
            RP_WRITE(REG_MSP_STATUS0,     &s0,        1u);
            RP_WRITE(REG_MSP_STATUS1,     &s1,        1u);

            /* --- Contact ack stub (all zeros — no radio on dev board) --- */
            static const uint8_t ack_stub[6] = { 0u, 0u, 0u, 0u, 0u, 0u };
            RP_WRITE(REG_CONTACT_ACK_SEQ, ack_stub,   6u);

            /* --- Mode command (STARTUP; no state machine yet) --- */
            RP_WRITE(REG_MODE_CMD,        &mode_byte, 1u);

            /* Increment CMD_SEQ so RP can ACK (monotonic, wraps at 255) */
            ++last_cmd_seq;
            RP_WRITE(REG_CMD_SEQ,         &last_cmd_seq, 1u);

            /* --- Telemetry --- */
            RP_WRITE(REG_TLM_MODE,        &mode_byte, 1u);
            RP_WRITE(REG_TLM_MSP_STATUS0, &s0,        1u);
            RP_WRITE(REG_TLM_MSP_STATUS1, &s1,        1u);

            if (g_ina_ok)
            {
                uint16_t v_mv = g_ina_data.bus_mv;
                int16_t  i_ma = g_ina_data.current_ma;
                RP_WRITE(REG_TLM_VBATT_MV, (const uint8_t *)&v_mv, 2u);
                RP_WRITE(REG_TLM_IBATT_MA, (const uint8_t *)&i_ma, 2u);
            }

            /* TLM_TBATT_CC — no sensor on dev board, leave as zero */

            /* ---- I2C reads from RP ---------------------------------------- */
            uint8_t rd[8];

            /* Header magic — check every 4 s */
            if ((g_current_second & 0x03u) == 0u)
            {
                if (prv_rp_read(REG_MAGIC0, rd, 5u) == I2C_OK)
                {
                    memcpy(g_rp_reg_snapshot.hdr_magic, rd, 4u);
                    g_rp_reg_snapshot.hdr_version = rd[4];
                    g_rp_reg_snapshot.hdr_ok =
                        (rd[0] == HDR_MAGIC0_VAL &&
                         rd[1] == HDR_MAGIC1_VAL &&
                         rd[2] == HDR_MAGIC2_VAL &&
                         rd[3] == HDR_MAGIC3_VAL) ? 1u : 0u;
                }
            }

            /* RP state/health block (0x10–0x17) — every second */
            if (prv_rp_read(REG_RP_STATE, rd, 8u) == I2C_OK)
            {
                g_rp_reg_snapshot.rp_state       = rd[0];
                g_rp_reg_snapshot.rp_uptime_s    = (uint32_t)rd[1]
                                                  | ((uint32_t)rd[2] << 8)
                                                  | ((uint32_t)rd[3] << 16)
                                                  | ((uint32_t)rd[4] << 24);
                g_rp_reg_snapshot.rp_hb_counter  = (uint16_t)rd[5]
                                                  | ((uint16_t)rd[6] << 8);
                g_rp_reg_snapshot.rp_last_error  = rd[7];
            }

            /* RP request flags (0x30–0x33) — every second */
            if (prv_rp_read(REG_RP_REQ_FLAGS, rd, 4u) == I2C_OK)
            {
                g_rp_reg_snapshot.rp_req_flags = rd[0];
                g_rp_reg_snapshot.rp_req_code  = rd[1];
            }

            /* Fault bitmap (0xF0–0xF5) — every 4 s */
            if ((g_current_second & 0x03u) == 0u)
            {
                if (prv_rp_read(REG_FAULT_BITMAP_L, rd, 6u) == I2C_OK)
                {
                    g_rp_reg_snapshot.fault_bitmap = (uint16_t)rd[0]
                                                   | ((uint16_t)rd[1] << 8);
                    g_rp_reg_snapshot.fault_seq    = rd[2];
                    /* rd[3] = LATCH_FLAGS, rd[4] = reserved, rd[5] = CNT_I2C_ERR */
                    g_rp_reg_snapshot.cnt_i2c_err  = rd[5];
                }
            }
        }

        #undef RP_WRITE

        /* Send tick to Rx task */
        xQueueSend(xTickQueue, &tick, 0u);
    }
}

/* ------------------------------------------------------------------
 * Rx task — LED toggle + WDT pulse + LED blink code
 * ------------------------------------------------------------------ */
static void prvRxTask(void *pvParameters)
{
    uint8_t  tick;
    uint32_t wdt1_counter = 0u;
    uint32_t wdt2_counter = 0u;
    (void)pvParameters;

    for (;;)
    {
        xQueueReceive(xTickQueue, &tick, portMAX_DELAY);

        /* Apply rail enables */
        prvApplyRailEnables();

        /* Pulse WDT1 (P2.2) */
        if (++wdt1_counter >= WDT_PULSE_PERIOD_S)
        {
            wdt1_counter = 0u;
            prvPulseWdt1();
        }

        /* Pulse WDT2 (P3.4) */
        if (++wdt2_counter >= WDT_PULSE_PERIOD_S)
        {
            wdt2_counter = 0u;
            prvPulseWdt2();
        }

        /* LED blink code — consumes blink_pending flag set by CLK task.
         * Runs blink sequence here (inside Rx) so we can use vTaskDelay
         * without affecting CLK task timing. Maximum blocking ~1.5 s which
         * is within the 2-second WDT pulse window. */
        if (g_blink_pending)
        {
            g_blink_pending = 0u;
            prvRunBlinkSequence();
        }
        else
        {
            /* Normal 1 Hz activity toggle */
            vParTestToggleLED(0);
        }
    }
}

/* ------------------------------------------------------------------
 * INA task — read INA219 @ 0x41 at 2 Hz
 * ------------------------------------------------------------------ */
static void prvInaTask(void *pvParameters)
{
    TickType_t   xNext  = xTaskGetTickCount();
    uint8_t      inited = 0u;
    ina219_data_t data;
    (void)pvParameters;

    if (g_ina_snapshot_ok)
        vTaskDelay(pdMS_TO_TICKS(15000u));

    for (;;)
    {
        vTaskDelayUntil(&xNext, pdMS_TO_TICKS(500u));

        if (!inited)
        {
            int8_t irc = ina219_init(&g_ina_3v3_msp);
            g_ina_diag_init_rc = irc;
            ++g_ina_diag_attempts;
            if (irc != INA219_OK)
                continue;
            inited = 1u;
        }

        {
            int8_t rrc = ina219_read(&g_ina_3v3_msp, &data);
            g_ina_diag_read_rc = rrc;
            if (rrc == INA219_OK)
            {
                g_ina_data        = data;
                g_ina_ok          = 1u;
                g_ina_snapshot    = data;
                g_ina_snapshot_ok = 1u;
            }
            else
            {
                g_ina_ok = 0u;
                inited   = 0u;
            }
        }
    }
}

/* ------------------------------------------------------------------
 * RP I2C read helper — performs read then yields 10 ms so CircuitPython
 * can process the next transaction.  Returns the i2c_read_reg() result
 * so callers can use it in if() conditions (the old RP_READ macro could
 * not be used that way).
 * ------------------------------------------------------------------ */
static int8_t prv_rp_read(uint8_t reg, uint8_t *buf, uint8_t len)
{
    int8_t rc = i2c_read_reg(RP_I2C_ADDR, reg, buf, (uint8_t)len);
    vTaskDelay(pdMS_TO_TICKS(10u));
    return rc;
}

/* ------------------------------------------------------------------
 * LED blink sequence
 *
 * Rapid mode (RP down):  BLINK_RAPID_COUNT fast pulses
 * Normal mode:           rp_state+1 pulses at BLINK_ON/OFF_MS cadence,
 *                        then BLINK_GAP_MS dark pause
 *
 * Uses vTaskDelay — Rx task blocks during blink (~1 s max).
 * WDT_PULSE_PERIOD_S = 2 s so one missed tick is always safe.
 * ------------------------------------------------------------------ */
static void prvRunBlinkSequence(void)
{
    uint8_t i;

    if (g_blink_rapid)
    {
        for (i = 0u; i < BLINK_RAPID_COUNT; i++)
        {
            prvLedSet(1u);
            vTaskDelay(pdMS_TO_TICKS(BLINK_RAPID_MS));
            prvLedSet(0u);
            vTaskDelay(pdMS_TO_TICKS(BLINK_RAPID_MS));
        }
        return;
    }

    /* N = rp_state + 1, clamped to [1, 8] */
    uint8_t n = (uint8_t)(g_blink_rp_state + 1u);
    if (n > 8u) n = 8u;

    for (i = 0u; i < n; i++)
    {
        prvLedSet(1u);
        vTaskDelay(pdMS_TO_TICKS(BLINK_ON_MS));
        prvLedSet(0u);
        if (i < (uint8_t)(n - 1u))
            vTaskDelay(pdMS_TO_TICKS(BLINK_OFF_MS));
    }
    vTaskDelay(pdMS_TO_TICKS(BLINK_GAP_MS));
}

/* ------------------------------------------------------------------
 * LED direct drive helper (P1.3 = LED0)
 * ------------------------------------------------------------------ */
static inline void prvLedSet(uint8_t on)
{
    if (on)
        GPIO_setOutputHighOnPin(GPIO_PORT_P1, GPIO_PIN3);
    else
        GPIO_setOutputLowOnPin(GPIO_PORT_P1, GPIO_PIN3);
}

/* ------------------------------------------------------------------
 * Rail enable helper
 * ------------------------------------------------------------------ */
static inline void prvApplyRailEnables(void)
{
    if (g_rega_en)   GPIO_setOutputLowOnPin (REGA_EN_PORT,     REGA_EN_PIN);
    else             GPIO_setOutputHighOnPin(REGA_EN_PORT,     REGA_EN_PIN);

    if (g_regb_en)   GPIO_setOutputLowOnPin (REGB_EN_PORT,     REGB_EN_PIN);
    else             GPIO_setOutputHighOnPin(REGB_EN_PORT,     REGB_EN_PIN);

    if (g_efusea_en) GPIO_setOutputLowOnPin (EFUSEA_SHDN_PORT, EFUSEA_SHDN_PIN);
    else             GPIO_setOutputHighOnPin(EFUSEA_SHDN_PORT, EFUSEA_SHDN_PIN);

    if (g_efuseb_en) GPIO_setOutputLowOnPin (EFUSEB_SHDN_PORT, EFUSEB_SHDN_PIN);
    else             GPIO_setOutputHighOnPin(EFUSEB_SHDN_PORT, EFUSEB_SHDN_PIN);
}

/* ------------------------------------------------------------------
 * WDT pulse helpers
 * ------------------------------------------------------------------ */
static inline void prvPulseWdt1(void)
{
    taskENTER_CRITICAL();
    P2OUT &= (uint8_t)~BIT2;
    __delay_cycles(WDT_LOW_CYCLES);
    P2OUT |= BIT2;
    taskEXIT_CRITICAL();
}

static inline void prvPulseWdt2(void)
{
    taskENTER_CRITICAL();
    P3OUT &= (uint8_t)~BIT4;
    __delay_cycles(WDT_LOW_CYCLES);
    P3OUT |= BIT4;
    taskEXIT_CRITICAL();
}
